app/controllers/products_controller.rb

SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.page params[:page]