app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "nam1@gmail.com"], ["password_digest", "$2a$10$cnd4ErFi9ybUsB5On8aVdOJCuWZVr8NsLAX2GglQeyudjI0UtjLfa"], ["updated_at", 2016-10-28 14:32:58 UTC], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    @delete = User.find(params[:id]).destroy